/**
 *
 * File: arithmitikiProodos.c
 *
 * Created by Yiannis Kiranis <std138327@ac.eap.gr>
 *
 * Date: 2019-01-16
 * Time: 22:29
 *
 * Άσκηση 1Δ, 3ης εργασίας 2016-2017
 *
 * Να γραφεί πρόγραμμα στη γλώσσα προγραμματισμού C, το οποίο διαβάζει το ακέραιο βήμα w μίας αριθμητικής προόδου και
 * έναν ακέραιο n από το 1 έως το 10 και τυπώνει τους όρους της αριθμητικής προόδου με αρχικό όρο 1 και βήμα w σε n
 * διαδοχικές γραμμές
 *
 */

#include <stdio.h>

int main()
{

    int i, j;
    int w, n;
    int sum=1;

    printf("Δώσε βήμα: ");
    scanf("%d", &w);

    do {
        printf("Δώσε αριθμό γραμμών (1-10): ");
        scanf("%d", &n);
    } while (n<1 || n>10);

    for(i=1; i<=n; i++) {
        for(j=1; j<=i; j++) {
            printf("%d ", sum);

            sum += w;
        }

        printf("\n");
    }

    return 0;
}
